package com.erp.task;


import java.io.BufferedOutputStream;
import java.io.BufferedReader;
import java.io.BufferedWriter;
import java.io.DataInputStream;
import java.io.DataOutputStream;
import java.io.IOException;
import java.io.InputStreamReader;
import java.io.OutputStreamWriter;
import java.net.Socket;

import javax.servlet.ServletConfig;
import javax.servlet.ServletException;
import javax.servlet.http.HttpServlet;
import javax.servlet.http.HttpServletRequest;
import javax.servlet.http.HttpServletResponse;

public class STServlet extends HttpServlet {
	public void init(ServletConfig config) throws ServletException {
		String serverMessage = "";
		Socket clientSocket=null;
		 
		try{

           
            String sendstr="####0010|6020|330400501|AC2A728F9F17B5D860B6DABD80A5162FCSK|33040050120161028000000019|admin|2016-10-28 11:03:16|2016-10-28 12:01:19|0~679578~330400~330411195404043630~01~330411195404043630~~CHN~唐明华~1~01~~~19540404~~~330400~11~~~~330400~手工导入~~~~~~~1~~~0~$$$$";  
            for(int i=1;i<=5;i++){
            	clientSocket = new Socket("10.82.18.51", 9000);  
                System.out.println("Client1:" + clientSocket);  
      
                DataInputStream dataIS = new DataInputStream(clientSocket.getInputStream());  
                InputStreamReader inSR = new InputStreamReader(dataIS, "GBK");  
                BufferedReader br = new BufferedReader(inSR);  
                  
                DataOutputStream dataOS = new DataOutputStream(clientSocket.getOutputStream());  
                OutputStreamWriter outSW = new OutputStreamWriter(dataOS, "GBK");  
                BufferedWriter bw = new BufferedWriter(outSW);  
            	if(i==1){
            	   sendstr="####0010|7005|330400501|F514CEC81CB148559CF475E7426EED5ECSK|33040050120161028000000071|admin|2016-10-28 13:20:20|2016-10-28 13:20:20|0~A90000001~330400D1560000058200002673436D00~300010477033~330400~20161028095401~1~3$$$$";
            	   System.out.println("发送数据 ：" + sendstr);  
                   bw.write(sendstr);     //加上分行符，以便服务器按行读取  
                   bw.flush();  
                   //接收数据  
                   while((sendstr = br.readLine()) != null) {  
                   	sendstr = sendstr.trim();  
                       System.out.println("服务器回复：" + sendstr);  
                       break;  
                   } 
            	 }else if(i==2){
            		 sendstr="####0010|7005|330400501|F514CEC81CB148559CF475E7426EED5ECSK|33040050120161028000000072|admin|2016-10-28 13:20:20|2016-10-28 13:20:20|0~A90000002~330400D1560000058200002673436D02~300010477032~330400~20161028095401~1~3$$$$";
              	     System.out.println("发送数据 ：" + sendstr);  
                     bw.write(sendstr);     //加上分行符，以便服务器按行读取  
                     bw.flush();  
                     //接收数据  
                     while((sendstr = br.readLine()) != null) {  
                     	sendstr = sendstr.trim();  
                         System.out.println("服务器回复：" + sendstr);  
                         break;  
                     } 
            	 }else if(i==3){
            		 sendstr="####0010|7005|330400501|F514CEC81CB148559CF475E7426EED5ECSK|33040050120161028000000073|admin|2016-10-28 13:20:20|2016-10-28 13:20:20|0~A90000003~330400D1560000058200002673436D03~300010477031~330400~20161028095401~1~3$$$$";
              	     System.out.println("发送数据 ：" + sendstr);  
                     bw.write(sendstr);     //加上分行符，以便服务器按行读取  
                     bw.flush();  
                     //接收数据  
                     while((sendstr = br.readLine()) != null) {  
                     	sendstr = sendstr.trim();  
                         System.out.println("服务器回复：" + sendstr);  
                         break;  
                     } 
            	 }else if(i==4){
            		 sendstr="####0010|7005|330400501|F514CEC81CB148559CF475E7426EED5ECSK|33040050120161028000000074|admin|2016-10-28 13:20:20|2016-10-28 13:20:20|0~A90000004~330400D1560000058200002673436D04~300010477030~330400~20161028095401~1~3$$$$";
              	     System.out.println("发送数据 ：" + sendstr);  
                     bw.write(sendstr);     //加上分行符，以便服务器按行读取  
                     bw.flush();  
                     //接收数据  
                     while((sendstr = br.readLine()) != null) {  
                     	sendstr = sendstr.trim();  
                         System.out.println("服务器回复：" + sendstr);  
                         break;  
                     } 
            	 }else if(i==5){
            		 sendstr="####0010|7005|330400501|F514CEC81CB148559CF475E7426EED5ECSK|33040050120161028000000075|admin|2016-10-28 13:20:20|2016-10-28 13:20:20|0~A90000005~330400D1560000058200002673436D05~300010477021~330400~20161028095401~1~3$$$$";
              	     System.out.println("发送数据 ：" + sendstr);  
                     bw.write(sendstr);     //加上分行符，以便服务器按行读取  
                     bw.flush();  
                     //接收数据  
                     while((sendstr = br.readLine()) != null) {  
                     	sendstr = sendstr.trim();  
                         System.out.println("服务器回复：" + sendstr);  
                         break;  
                     } 
            	 }
            
            	 
            
                //sendstr="####0010|7004|330400501|315B4DF935F4775EF5033A4833A9E0E1CSK|33040050120161028000000026|admin|2016-10-28 11:20:20|2016-10-28 11:20:20|0~A90000005~330400D1560000058200002673436D05~330400~D1560000058200002673436D05~20160928~20251231~1~~~300010477021~33041119520901421X~张永良~0~~1.0X~3301000001~3~0~11330100_2013070101~3~2016-09-28~2016-09-28~1.0~915600000233010033010016~2016-11-10~123$$$$";
                //发送 sendstr="####0010|7004|330400501|315B4DF935F4775EF5033A4833A9E0E1CSK|33040050120150925000002002|admin|2016-09-23 18:20:20|2016-09-23 18:20:20|0~M80000011~317000D156000005000002517703BA89~330400~D156000005000002517703BA89~20160804~20251231~1~~~300010282956~330106196702060110~徐宝春~0~~1.0X~3301000001~3~0~11330100_2013070101~3~2016-09-10~2016-09-10~1.0~915600000233010033010015~2016-03-10~123$$$$";
                //sendstr="####0010|7030|330400501|B25B911FFC2B76A647454E5A53EDF8B5CSK|33040050120161027000000005|admin|2016-08-23 09:54:07|2016-08-23 09:55:46|0~A90000005~330400D1560000058200002673436D16~300010295011~330400~20160823095407~E00000006~331083D1560000058200002673436D78~331083$$$$";
               //sendstr="####0010|7005|330400501|F514CEC81CB148559CF475E7426EED5ECSK|33040050120161027000000005|admin|2016-10-27 10:20:20|2016-10-27 10:29:20|0~A90000005~330400D1560000058200002673436D14~300010295004~330400~20160928100809~1~3$$$$";
             
              //sendstr="####0010|7020|330400501|35A12C43227F217207D4E06FFEFE39D3CSK|33040050120150928000003604|admin|2016-08-23 09:37:02|2016-08-23 09:39:53|0~A90000005~330400~300010295004~330400D1560000058200002673436D14~~~6217256********4674$$$$";
              //sendstr="####0010|7017|330400501|E9A53D0ED1816293EF27647C7B33D819CSK|33040050120161028000000031|admin|2016-10-27 18:20:20|2016-09-01 12:20:20|0~0~~33041119520901421X~张永良~~~$$$$";
               //sendstr="####0010|7015|330400501|885FE656777008C335AC96072A45BE15CSK|33040050120161028000000036|admin|2016-10-28 12:20:20|2016-10-28 12:20:20|0~330400~330411195404043630~A90000001~330400D1560000058200002673436D00~唐明华$$$$";
              
             //sendstr="####0010|7010|330400501|281715CAFA675BF359EBAA42CB44FA17CSK|33040050120161027000000007|admin|2016-10-27 15:20:20|2016-10-27 15:20:20|0~2~300010295003~33262119261102125X~吴潮水~1~L1~1~qtf.jpg|/9j/4AAQSkZJRgABAQAAAQABAAD/2wBDAAMCAgMCAgMDAwMEAwMEBQgFBQQEBQoHBwYIDAoMDAsKR+tTk8GqbTsL1xgY6/pUpuGI6CgCwpwM/rQRnrVYztjoKQXTHqF/WmB//9k=$$$$";
             //发送数据  
         
            inSR.close();  
            dataIS.close();  
            dataOS.close();
            clientSocket.close();
            }
            //指纹上传7010
            //发送数据 ：####0010|7010|330400501|281715CAFA675BF359EBAA42CB44FA17CSK|33040050120150926000002163|admin|2016-10-27 18:20:20|2016-10-27 18:20:20|0~2~300010283116~332621196708121175~程金利~1~L1~1~qtf.jpg|/9j/4AAQSkZJRgABAQAAAQABAAD/2wBDAAMCAgMCAgMDAwMEAwMEBQgFBQQEBQoHBwYIDAoMDAsKR+tTk8GqbTsL1xgY6/pUpuGI6CgCwpwM/rQRnrVYztjoKQXTHqF/WmB//9k=$$$$
            //服务器回复：####0010|7010|330400501|CP74YWPPDAATXTGFW733YUM4Y5ENT2K7|33040050120150926000002163|0|2016-09-27 11:26:13|0|0||新增成功~0~新增成功$$$$
            
            //社保卡鉴权7015
            //发送数据 ：####0010|7015|330400501|885FE656777008C335AC96072A45BE15CSK|33040050120150926000002162|admin|2015-09-01 18:20:20|2015-09-01 18:20:20|0~330400~332621196708121175~E00002569~330400D1560000058200002673436D19~程金利$$$$
            //服务器回复：####0010|7015|330400501|QH3SJWWD9ZQ43YE8A78FEWYRNYGWWEK1|33040050120150926000002162|100000000003260059|2016-09-27 11:19:13|0|0||社保卡鉴权成功~1~社保卡鉴权成功$$$$
            
            //卡信息补全7020
            //发送数据 ：####0010|7020|330400501|35A12C43227F217207D4E06FFEFE39D3CSK|33040050120150926000002161|admin|2016-08-23 09:37:02|2016-08-23 09:39:53|0~E00002569~330400~300010283116~330400D1560000058200002673436D19~~~6217256********4679$$$$
            //服务器回复：####0010|7020|330400501|09712PWVALROLWNAGJH25QCPQEQFU7HP|33040050120150926000002161|100000000003260058|2016-09-27 11:16:16|0|0||卡信息补全全部成功1~0~卡信息补全全部成功$$$$
            
            //卡查询7017
            //发送数据 ：####0010|7017|330400501|E9A53D0ED1816293EF27647C7B33D819CSK|330400501 20150925000002019|admin|2015-09-01 18:20:20|2015-09-01 18:20:20|0~0~~~~M80000011~330400~317000D156000005000002517703BA89$$$$
            //服务器回复：####0010|7017|330400501|FRN1TJ251LE317SNGV4W1B01CWUT2LV1|33040050120150925000002019|100000000003135075|2016-09-26 17:54:35|0|2||~~~~~~~~~~~~~~~$$$$
            
            //卡状态变更7005
            //发送数据 ：####0010|7005|330400501|F514CEC81CB148559CF475E7426EED5ECSK|33040050120150925000002005|admin|2015-09-21 18:20:20|2015-09-21 18:20:20|0~M80000011~317000D156000005000002517703BA89~300010282956~330400~20140826160809~1~3$$$$
            //服务器回复：####0010|7005|330400501|HJTBRJIL92DHEGOTGTC0HO84ID1ZRJQF|33040050120 150925000002005|100000000003125304|2016-09-26 17:18:18|0|0||卡变更全部成功1~0~卡变更全部成功$$$$
            
            //卡片统筹区变更7030
            //发送数据 ：####0010|7030|330400501|B25B911FFC2B76A647454E5A53EDF8B5CSK|33040050120150925000002068|admin|2016-08-23 09:54:07|2016-08-23 09:55:46|0~M80000011~317000D156000005000002517703BA89~300010282956~330400~20160823095407~M80000012~317000D156000005000002517703BA88~331083$$$$
            //服务器回复：####0010|7030|330400501|YJBXQ31QAGCD65LBVOVGT7RNOPPOB25J|33040050120160926990833089|100000000003131562|2016-09-26 17:41:36|0|0||卡新增全部成功1~0~卡新增全部成功$$$$
            
            //卡信息增加7004
            //发送数据 ：####0010|7004|330400501|315B4DF935F4775EF5033A4833A9E0E1CSK|33040050120150925000002002|admin|2016-09-23 18:20:20|2016-09-23 18:20:20|0~M80000011~317000D156000005000002517703BA89~330400~D156000005000002517703BA89~20160804~20251231~1~~~300010282956~330106196702060110~徐宝春~0~~1.0X~3301000001~3~0~11330100_2013070101~3~2016-09-10~2016-09-10~1.0~915600000233010033010015~2016-03-10~123$$$$
            //服务器回复：####0010|7004|330400501|ZH3E02F5X9C58I4DGI5V9NG7C5SO4TW3|33040050120150925000002002|100000000003122294|2016-09-26 17:07:10|0|0||卡新增全部成功1~0~卡新增全部成功$$$$
            //发送数据 ：####0010|7004|330400501|315B4DF935F4775EF5033A4833A9E0E1CSK|33040050120150926000002901|admin|2016-09-23 18:20:20|2016-09-23 18:20:20|0~A90000001~317000D156000005000002517703BA00~330400~D156000005000002517703BA00~20160804~20251231~1~~~300010283030~330402197208260614~雷龙~0~~1.0X~3301000001~3~0~11330100_2013070101~3~2016-09-10~2016-09-10~1.0~915600000233010033010015~2016-03-10~123$$$$
            //服务器回复：####0010|7004|330400501|IJX6983QSHGAABZ0UK9LP9KY1B1O0GGX|33040050120150926000002901|100000000003260038|2016-09-27 10:00:30|0|0||卡新增全部成功1~0~卡新增全部成功$$$$
            //发送数据 ：####0010|7004|330400501|315B4DF935F4775EF5033A4833A9E0E1CSK|33040050120150926000002160|admin|2016-09-23 18:20:20|2016-09-23 18:20:20|0~E00002569~330400D1560000058200002673436D19~330400~D1560000058200002673436D19~20160927~20251231~1~~~300010283116~332621196708121175~程金利~0~~1.0X~3301000001~3~0~11330100_2013070101~3~2016-09-27~2016-09-27~1.0~915600000233010033010016~2016-11-10~123$$$$
            //服务器回复：####0010|7004|330400501|WZOK56N8OHA1QTZ02N82I6A3SRQ69NK9|33040050120150926000002160|100000000003260057|2016-09-27 11:13:23|0|0||卡新增全部成功1~0~卡新增全部成功$$$$
            
            //人员新增加6020
            //发送数据：  ####0010|6020|330400501|AC2A728F9F17B5D860B6DABD80A5162FCSK|33040050120160810000051900|admin|2016-08-09 15:23:16|2016-08-10 00:31:19|0~679578~330400~330106196702060110~01~330106196702060110~~CHN~徐宝春~1~01~~~19670206~~~331004~11~~~~331004~路桥区新安小区39幢~~~~~~~1~~~0~$$$$;  
            //服务器回复：####0010|6020|330400501|AC2A728F9F17B5D860B6DABD80A5162FCSK|33040050120160926001212662|7409200|2016-09-26 16:29:12|0|0||全民参保【交易成功】持卡库【人员新增成功。】~0~全民参保【交易成功】持卡库【人员新增成功。】~9626719~300010282956~~0~160926160943$$$$        
            //发送数据 ：####0010|6020|330400501|AC2A728F9F17B5D860B6DABD80A5162FCSK|33040050120160910000051912|admin|2016-08-09 15:23:16|2016-08-10 00:31:19|0~679578~330400~330402197208260614~01~330402197208260614~~CHN~雷龙~1~01~~~19720826~~~331004~11~~~~331004~路桥区新安小区39幢~~~~~~~1~~~0~$$$$
            //服务器回复：####0010|6020|330400501|AC2A728F9F17B5D860B6DABD80A5162FCSK|33040050120160927001212664|7409273|2016-09-27 10:12:28|0|0||全民参保【交易成功】持卡库【人员新增成功。】~0~全民参保【交易成功】持卡库【人员新增成功。】~9711422~300010283030~~0~160927095258$$$$
            //发送数据 ：####0010|6020|330400501|AC2A728F9F17B5D860B6DABD80A5162FCSK|33040050120160926000051992|admin|2016-08-09 15:23:16|2016-08-10 00:31:19|0~679578~330400~332621196708121175~01~332621196708121175~~CHN~程金利~1~01~~~19670812~~~330400~11~~~~330400~路桥区新安小区39幢~~~~~~~1~~~0~$$$$
            //服务器回复：####0010|6020|330400501|AC2A728F9F17B5D860B6DABD80A5162FCSK|33040050120160927001212667|7409306|2016-09-27 11:23:09|0|0||全民参保【交易成功】持卡库【人员新增成功。】~0~全民参保【交易成功】持卡库【人员新增成功。】~9711427~300010283116~~0~160927110339$$$$
		} catch (Exception ee) {
			ee.printStackTrace();
		} finally {
			try {
				System.out.println("结束......");
			} catch (Exception e) {
				e.printStackTrace();
			}
		}
		

	}

	public void doGet(HttpServletRequest request, HttpServletResponse response)
			throws ServletException, IOException {

	}

	public void doPost(HttpServletRequest request, HttpServletResponse response)
			throws ServletException, IOException {

	}

	public void destroy() {

	}
}
